class App4
{
    public static void main(String[] params) 
	{
		float Value = Float.parseFloat(params[0]);
		
		if (Value%2!=0)
		{
			System.out.println("The number is not even!");
		}
		else 
		{
			System.out.println("The number is even!");
		}
    }
}  

//4) Написать программу, которая проверит, является ли число четным или нечетным
//Teacher: Write 5 and beside it another 5!